server/app/controllers/assignments_controller.rb

  def index
    @assignments = Assignment.all
---
SELECT "assignments".* FROM "assignments"

  def create
    @assignment = Assignment.new(assignment_params)
    @labs = Lab.all

    respond_to do |format|
      if @assignment.save
---
INSERT INTO "assignments" ("name", "spec", "description", "test", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def set_assignment
    @assignment = Assignment.find(params[:id])
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", 1]]